{
  "_name_or_path": ".\\models\\base-distilbert",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "VPN",
    "1": "Password_Reset",
    "2": "Hardware",
    "3": "Software_Install",
    "4": "Payroll",
    "5": "Network",
    "6": "Security",
    "7": "Email",
    "8": "Printer",
    "9": "Access_Request",
    "10": "Data_Recovery",
    "11": "Performance",
    "12": "Onboarding",
    "13": "Offboarding",
    "14": "Compliance",
    "15": "Cloud_Storage",
    "16": "Mobile_Device",
    "17": "Database",
    "18": "Application_Error",
    "19": "Billing"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Access_Request": 9,
    "Application_Error": 18,
    "Billing": 19,
    "Cloud_Storage": 15,
    "Compliance": 14,
    "Data_Recovery": 10,
    "Database": 17,
    "Email": 7,
    "Hardware": 2,
    "Mobile_Device": 16,
    "Network": 5,
    "Offboarding": 13,
    "Onboarding": 12,
    "Password_Reset": 1,
    "Payroll": 4,
    "Performance": 11,
    "Printer": 8,
    "Security": 6,
    "Software_Install": 3,
    "VPN": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "vocab_size": 30522
}
